gary_miller_art_share_api/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        # displays all users data
        render json: User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Cain"], ["email", "the1son@edenmail.com"], ["created_at", "2022-04-16 05:07:16.475511"], ["updated_at", "2022-04-16 05:07:16.475511"]]
---
    def create
        # makes a new user given name and email nested under user
        user = User.new(user_params)
        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        # displays a specific user
        render json: User.find(params[:id])